{"pages":[],"posts":[{"title":"Create and deploy your hexo blog","text":"Set up Install Node.js Install Git Create a Github account Once you finished installing, open the command prompt and install hexo by typing the following command. npm install -g hexo-cli Move to your working directory and initiate your hexo blog hexo init Hexo automatically generates these files Test it by running hexo server Open your browser and go to port http://localhost:4000/ it should give you a page that looks this. Create your first blogCreate your first blog by running hexo new &quot;blog_title&quot; In my case i’m doing hexo new &quot;Create a Blog and deploy it with Hexo&quot; you can view your blog files under .\\source\\_posts All of them are in markdown format (.md) https://www.markdowntutorial.com/ Edit them by using any text-editor you prefer. Here are some free online editors https://stackedit.io/ https://dillinger.io/ https://pandao.github.io/editor.md/en.html If you wanna add some images to your blog, you could upload your image file to a image hosting web site first and paste the link in your .md file.Here are some free image hosting web sites https://imgchr.com/?lang=en https://imgur.com/ https://imgbb.com/ Deploy your blog on github pageOnce you’ve done editting your blog, i can deploy itSign in to your github account, Create a new repository.The repository name should be in this format [account_name].github.io in my case: Next we’ll install a plug-in that deploys our blog to github, run: npm install --save hexo-deployer-git After that we need to add a few line to the configuration file.open: _config.yml Scroll all the way down to the bottom, under Deployment type thisRepo Address can be found here, make sure you choose SSH To deploy your website enter the following command in your command propmt. hexo clean ///clean old static files hexo generate ///generate new static files hexo deploy ///deploy If an error like this has occured The file will have its original line endings in your working directory On branch master nothing to commit, working tree clean remote: Permission to esprojectteam666/esprojectteam666.github.io.git denied to szhang182. fatal: unable to access 'https://github.com/esprojectteam666/esprojectteam666.github.io.git/': The requested URL returned error: 403 [41mFATAL[49m { err: Error: Spawn failed at ChildProcess.&lt;anonymous&gt; (C:\\Users\\sean\\projects\\hexo_blog\\node_modules\\hexo-deployer-git\\node_modules\\hexo-util\\lib\\spawn.js:51:21) at ChildProcess.emit (events.js:315:20) at ChildProcess.cp.emit (C:\\Users\\sean\\projects\\hexo_blog\\node_modules\\cross-spawn\\lib\\enoent.js:34:29) at Process.ChildProcess._handle.onexit (internal/child_process.js:275:12) { code: 128 } } Something's wrong. Maybe you can find the solution here: %s [4mhttps://hexo.io/docs/troubleshooting.html[24m Do the following step Step 1: Check your SSH keylogin to github, go to Setting–&gt;SSH and GPS keys, check if you have SSH keys, if yes go to step 3, if no, then continue. Step 2 : Generate new SSH key in git bash1$ ssh-keygen -t rsa -C &quot;[your_email_address]&quot; Enter the path you want your ssh to be saved 1234Generating public/private rsa key pair.Enter file in which to save the key (/c/Users/sean/.ssh/id_rsa):Enter passphrase (empty for no passphrase):Enter same passphrase again: You can enter the passphrase if you want to, but you don’t have to.If you enter the passphrase it’s gonna ask you for it each time you update it. 1234567891011121314Your identification has been saved in /c/Users/sean/.ssh/id_rsa.Your public key has been saved in /c/Users/sean/.ssh/id_rsa.pub.The key fingerprint is:65:69:······02:4b emailname@email.comThe key's randomart image is:+--[ RSA 2048]----+| || . o . || . o o = o || . o * = o || E o + o . || . o. . . || .. |+-----------------+ your ssh has being generated Step 3: Add SSH key to your github account： Open the new generated “id_rsa.pub” in my case it’s under this path c/Users/sean/.ssh/id_rsa.pub, CTRL-A select all and copy it. login to github,go to Settings –&gt; SSH and GPG keys –&gt; New SSH key，add SSH key paste the key in the box, title is optional. Step 4 : Test the configuration：run : 1$ ssh -T git@github.com It might say： 123The authenticity of host 'github.com (192.30.252.1)' can't be established.RSA key fingerprint is 16:27:xx:xx:xx:xx:xx:xx:xx:xx:xx:xx:xx:xx:a6:48.Are you sure you want to continue connecting (yes/no)? Or 123The authenticity of host 'github.com (192.30.252.1)' can't be established.RSA key fingerprint is nThDFGHJK&lt;NLIKHJNLKxdCARLviKw6E5SY8.Are you sure you want to continue connecting (yes/no)? Type yes and enter Step5: Config user info：12$ git config --global user.name &quot;[github_username]&quot;$ git config --global user.email &quot;[github_email]&quot; Step6: DeployTo deploy your website enter the following command in your command propmt. hexo clean ///clean old static files hexo generate ///generate new static files hexo deploy ///deploy you can go check your static blog under at[account_name].github.ioin mycase https://esprojectteam666.github.io/","link":"/2020/09/30/Create-and-deploy-your-hexo-blog/"},{"title":"LeetCode Animation","text":"","link":"/2020/09/30/LeetCode-Animation/"}],"tags":[],"categories":[]}